{
  "mammals": [
    {
      "id": "1",
      "name": "Gorillas",
      "description": "Gorillas live in Central Africa. There are two main species of gorilla, the Eastern Gorilla and the Western Gorilla. The Western Gorilla lives in Western Africa in countries such as Cameroon, the Congo, the Central African Republic, and Gabon. The Eastern Gorilla lives in Eastern African countries such as Uganda and Rwanda. Gorillas live in a range of habitats from swamps to forests. There are lowland gorillas which live in bamboo forests, swamps and lowland forests. There are also mountain gorillas which live in forests in the mountains. Gorillas are mostly herbivores and eat plants. The plants they eat include leaves, stems pith, fruit, and bamboo. Sometimes they will eat insects, especially ants. A full grown adult male will eat around 50 pounds of food in a day. Gorillas are the largest species of primates. The males are often twice as big as the females. The males grow to around 5 1/2 feet tall and weigh around 400 pounds. The females grow to 4 1/2 feet tall and weigh around 200 pounds. Gorillas have long arms, even longer than their legs! They use their long arms to &ldquo;knuckle-walk&rdquo;. This is where they use the knuckles on their hands to walk on all fours. They are mostly covered with brown hair. Gorillas from different areas may have different coloured hair. For example, the western gorilla has the lightest hair and the mountain gorilla has the darkest. The western lowland gorilla can also have grayish hair and red coloured forehead. When male gorillas get older their hair turns white on their back. These older males are called Silverback gorillas. "
    },
    {
      "id": "2",
      "name": "Horses",
      "description": "Horses are four legged animals that have had a long relationship with humans. They were once a major form of transportation for humans. They also performed many jobs for humans over the years. The scientific name for horse is Equus ferus caballus. There are over 300 different breeds of horses. Horse breeds come in a number of different sizes, colors, and skill sets. There are three main types of horse breeds: Hot bloods are fast horses bred for speed and racing. Cold bloods are generally bred for strength and heavy work. Warm bloods are a combination of the other two types and are often used for riding competitions. Horses are grazing animals and mostly eat hay and grasses. They also like legumes like peas and beans, fruit such as apples, and even carrots. Sometimes they are fed grains such as corn or oats. The only truly wild horses that are not extinct are the Przewalski's Horses which live in China and Mongolia. They are nearly extinct and are classified as critically endangered. There are also horses that live in the wild that came from domesticated horses. These are called feral horses. "
    },
    {
      "id": "3",
      "name": "Red Wolf",
      "description": "Despite their name, red wolves can have a variety of coat colors including yellow, black, brown, gray, and red. Often the fur behind their legs and ears will have a reddish tint. They are similar in size to a German shepherd dog. The males grow to around 30 inches tall at the shoulder and weigh around 60 to 80 pounds. They are smaller than gray wolves, but bigger than coyotes. The females are slightly smaller than the males. Red wolves are carnivores and, therefore, mostly eat meat. Their primary food consists of small rodents, rabbits, raccoons, and deer. They will also eat insects and berries. Red wolves live in North America. At one time there were red wolves over much of the Southeastern United States, however, due to habitat loss and hunting, they became extinct in the wild in 1980. Fortunately, there were still some red wolves living in zoos. Since then they have been reintroduced into the wild and now live in protected areas in North Carolina. Red wolves prefer the habitats of forests, costal prairies, and sometimes swamps. "
    },
    {
      "id": "4",
      "name": "Bactrian Camel",
      "description": "The Bactrian camel is most famous for the two large humps on its back. It is a huge camel that can grow to over seven feet tall at the shoulder! It can grow to over eleven feet long and weight over 2000 pounds. It has a brown fur coat that gets long and shaggy in the winter to help it keep warm in the cold desert. The coat sheds for the summer. Bactrian camels are herbivores, meaning they eat plants. They can eat most any type of vegetation including dry, thorny, or bitter plants that other animals may not want to eat. Their digestive system is tough and they have been known to eat dead carcasses, clothing, and even shoes when extremely hungry. They tend to live in groups of 6 to 20 camels. Sometimes they will gather in larger groups near water sources such as rivers. Camels store fat in their humps. This fat can be converted to water and energy when they haven't had food or water to drink for some time. Once they have used up all the fat in their humps, the humps become thin and floppy. The energy in their humps, as well as other adaptations that help them to conserve water, allows Bactrian camels to go for months without drinking water. A thirsty camel can drink a lot of water, however. Camels have been known to drink over 30 gallons of water in just a few short minutes! Besides having two large humps to help them go without water, Bactrian camels have other qualities that help them to survive in the desert. They have bushy eyebrows and long eye lashes that help protect their eyes from the sand. Their nostrils can close as well to keep out the sand. They also have big, tough footpads that help them to carry heavy packs over difficult desert terrain. These qualities make them the ideal pack animal for travellers crossing the desert. "
    },
    {
      "id": "5",
      "name": "Dolphins",
      "description": "Dolphins are some of the most playful and intelligent animals on our planet. Even though dolphins spend their lives in the water, they are not fish, but are mammals. Dolphins can't breathe water like fish, but need to come to the surface to breath air. There are many kinds of dolphins. Perhaps the most famous are the Bottlenose Dolphin and the Killer Whale (that's right the Orca, or Killer Whale, is a member of the dolphin family). Dolphins are very social animals. Many dolphins travel in groups called pods. Some dolphins, like Killer Whales, live in pods of 5-30 members for their entire lives. Each pod behaves differently. Some pods migrate and travel around the world, while others have a specific territory. Sometimes pods can group together to make giant pods as large as 1000 or more dolphins. Baby dolphins are called calves. The males are called bulls and the females are called cows.The largest dolphin is the Killer Whale which grows up to 23 feet long and can weight over 4 tons. The smallest dolphin is the Heaviside's Dolphin which grows to just over 3 feet long and weighs around 90 pounds. Dolphins have long snouts that typically hold around 100 teeth. They also have a blowhole on the top of their head that they use for breathing. For the most part, dolphins eat other smaller fish, but they are not limited to just fish. They eat squid, too, and some dolphins, like Killer Whales, will often eat small sea mammals like seals and penguins. Dolphins often hunt together, herding fish into packed groups or into inlets where they can be easily caught. Some dolphins will share their food with the young or let the young catch injured prey as practice. They don't chew their food, they swallow it whole. Dolphins get the water they need from the animals they eat, rather than drinking ocean water. Dolphins communicate through chirps and whistles. Not a lot is known about their communication. They like to jump and play and do acrobatic spins in the air. They have been known to surf waves near the beach or follow the wake of ships. Dolphins are also very trainable as shown by the shows they put on at ocean parks like Sea World. Dolphins have excellent eyesight and hearing. Underwater they use echolocation. Echolocation is kind of like sonar where dolphins make a sound and then listen to the echo. Their hearing is so sensitive to these echoes that they can almost &rhquo;see&lhquo; objects in the water by hearing. This allows dolphins to locate food in cloudy or dark water. Dolphins have to sleep, so how do they do this without drowning? Dolphins let half of their brain sleep at a time. While one half sleeps the other half is enough awake to keep the dolphin from drowning. Dolphins may float at the surface while sleeping or swim slowly to the surface every now and then for a breath. v"
    },
    {
      "id": "6",
      "name": "Rhinoceros",
      "description": "The Rhinoceros is most famous for its large horn, or horns, right on the top of its head near its nose. Some types of Rhinos have two horns and some one horn. Rhinos are also very large. Some of them can easily weigh more than 4000 pounds! Rhinoceroses also have very thick skin. A group of rhinos is called a crash. Rhinos are herbivores, meaning they eat only plants. They can eat all sorts of plants depending on what's available. They prefer leaves. Rhino horns are made of keratin. This is the same stuff that makes up your finger and toe nails. The size of the horn can vary depending on the type of rhino. For example, a typical horn on a white rhino will grow to around 2 feet long. However, some horns have been known to get close to 5 feet long! Many cultures prize the horns. It is the hunting of the horns that has caused rhinos to become endangered. Javan Rhinoceros - This rhino is nearly extinct. It is thought that there are only 60 left in the world. It comes from Indonesia (another name for Java) as well as Vietnam. Javan Rhinos like to live in the rain forest or tall grass. They only have a single horn and it's the hunting of this horn that has nearly pushed the Javan Rhino to extinction. Sumatran Rhinoceros - Like its name, this rhino comes from Sumatra. Since Sumatra is cold, the Sumatran Rhino has the most hair or fur of all the Rhinos. The Sumatran Rhino is also the smallest of the Rhinos and has short stubby legs. It is critically endangered with around 300 left in the world. Black Rhinoceros - This rhino comes from Africa. It's not really black, as the name indicates, but is a light gray color. Black rhinos can weigh as much as 4000 pounds, but it is still smaller than the white rhino. They have two horns and are also critically endangered. Indian Rhinoceros - Guess where the Indian rhino comes from? That's right, India! Together with the white rhino the Indian rhino is the largest and can weigh well over 6000 pounds. It has one horn. White Rhinoceros - The white rhino hails from Africa. Like the black rhino the white rhino isn't really white, but gray. The white rhino is huge and, after the elephant, is one of the largest land mammals on the planet. It has 2 horns. There are around 14,000 white rhinos left on earth making it the most populous of the rhinos. "
    }
  ]
}